app/controllers/locations_controller.rb

  def show
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE ("locations"."id" = 1) LIMIT 1

  def edit
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE ("locations"."id" = 4) LIMIT 1

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("title", "is_active", "created_at", "lat", "updated_at", "user_id", "lng") VALUES ('New Active', 't', '2011-02-15 16:22:52.463332', 42.356496, '2011-02-15 16:22:52.463332', 1, -71.067679)

  def update
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE ("locations"."id" = 4) LIMIT 1