app/controllers/works_controller.rb

  def index
    @works = Work.all
---
SELECT "works".* FROM "works"

  def show
    @work = Work.find(params[:id])
    @artist = Artist.find_by_id(@work.artist_id)
---
SELECT "works".* FROM "works" WHERE ("works"."id" = 1) LIMIT 1
SELECT "artists".* FROM "artists" WHERE ("artists"."id" = 1) LIMIT 1

  def edit
    @work = Work.find(params[:id])
---
SELECT "works".* FROM "works" WHERE ("works"."id" = 2) LIMIT 1

  def create
    @work = Work.new(params[:work])

    respond_to do |format|
      if @work.save
---
INSERT INTO "works" ("artist_id", "sketch", "description", "title", "created_at", "is_real", "updated_at", "location_id") VALUES (1, 'http://imgur.com/gallery/fMH5N', 'Not the devil at all.', 'Pas El Diablo', '2011-02-15 15:50:06.081954', 'f', '2011-02-15 15:50:06.081954', 1)

  def update
    @work = Work.find(params[:id])

    respond_to do |format|
      if @work.update_attributes(params[:work])
---
SELECT "works".* FROM "works" WHERE ("works"."id" = 2) LIMIT 1
UPDATE "works" SET "sketch" = 'http://i.imgur.com/fMH5N.jpg', "updated_at" = '2011-02-15 15:50:50.374566' WHERE ("works"."id" = 2)