app/views/locations/index.html.erb

SELECT "users".* FROM "users" WHERE ("users"."id" = 3) LIMIT 1
SELECT "works".* FROM "works" WHERE ("works".location_id = 3)
---
				'<p> proposed by:'+
				'<%=User.find_by_id(location.user_id).username %></p>'+
				'<h3>Current Works:</h3> <ul>'+
				<% location.works.each do |work| %>